In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline

In [2]:
df1=pd.read_csv('bengaluru_house_prices.csv')

In [3]:
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
df1.shape

(13320, 9)

In [5]:
df1['area_type'].value_counts()  # Return a Series containing counts of unique rows in the DataFrame.

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

In [6]:
df1.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [7]:
# To keep the model simple we will drop certain columns
df2=df1.drop(['area_type','society','balcony','availability'],axis='columns')
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [8]:
# handling na values

df2.isna().sum()
#df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [9]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

We can either replace the NA/Null values with any one of the "measure of central tendency"(mean/meadian/mode) or else we can drop these rows consisting of NA values. For the sake of simplicity we are dropping these rows here as the no of rows having na values (1+16+0+73+0) is very less than the total data points(around 13K), so we can drop these rows without loosing any significant information .

In [10]:
df3=df2.dropna()
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [11]:
df3.shape

(13246, 5)

The Size column has irregularity with the kind of values it has. So we will have to do some processing here so that all the values are in one standard way

In [12]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

Here we can see that there are different ways in which same bedroom apartment has been written. So for making things work we will create a new column(no_of_bedrooms) based upon the integral value in each value

In [13]:
df3['no_of_bedrooms'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

C:\Users\lenovo\AppData\Local\Temp/ipykernel_42932/154619437.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['no_of_bedrooms'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

In [14]:
df3.head()

,location,size,total_sqft,bath,price,no_of_bedrooms
0,Electronic City Phase II,2 BHK,1056,2.0,39.07,2
1,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4
2,Uttarahalli,3 BHK,1440,2.0,62.00,3
3,Lingadheeranahalli,3 BHK,1521,3.0,95.00,3
4,Kothanur,2 BHK,1200,2.0,51.00,2

In [15]:
df3['no_of_bedrooms'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [16]:
df3[df3['no_of_bedrooms']>20]

,location,size,total_sqft,bath,price,no_of_bedrooms
1718,2Electronic City Phase II,27 BHK,8000,27.0,230.0,27
4684,Munnekollal,43 Bedroom,2400,40.0,660.0,43

Here we see some error(domain expertise!!). We can't have 43 bhk in just 2400 sqft so , probably there might be some error during data collection

In [17]:
df3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [18]:
df3['total_sqft'].value_counts()

1200    843
1100    221
1500    204
2400    195
600     180
       ...
5985      1
3580      1
2461      1
1437      1
4689      1
Name: total_sqft, Length: 2067, dtype: int64

We see some values in 'total_sqft' column is in range format...so we will have to do some processing here as well so that our entire data in a specific column is in a single format.

In [19]:
# To see what are the different values in 'total_sqft' column we will create a function

In [20]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [21]:
# This will give me a subset of dataframe consisting of all those values of 'total_sqft' column for whill is_float() returns false.
df3[~df3['total_sqft'].apply(is_float)]

                 location   size   total_sqft  bath    price  no_of_bedrooms
30              Yelahanka  4 BHK  2100 - 2850   4.0  186.000               4
122                Hebbal  4 BHK  3067 - 8156   4.0  477.000               4
137    8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005               2
165              Sarjapur  2 BHK  1145 - 1340   2.0   43.490               2
188              KR Puram  2 BHK  1015 - 1540   2.0   56.800               2
...                   ...    ...          ...   ...      ...             ...
12975          Whitefield  2 BHK   850 - 1060   2.0   38.190               2
12990      Talaghattapura  3 BHK  1804 - 2273   3.0  122.000               3
13059              Harlur  2 BHK  1200 - 1470   2.0   72.760               2
13265               Hoodi  2 BHK  1133 - 1384   2.0   59.135               2
13299          Whitefield  4 BHK  2830 - 2882   5.0  154.500               4

[190 rows x 6 columns]

In [22]:
# Here also we see that values are not only in range form , but in a different unit altogether as shown below
df3[~df3['total_sqft'].apply(is_float)].head(10)

,location,size,total_sqft,bath,price,no_of_bedrooms
30,Yelahanka,4 BHK,2100 - 2850,4.0,186.000,4
122,Hebbal,4 BHK,3067 - 8156,4.0,477.000,4
137,8th Phase JP Nagar,2 BHK,1042 - 1105,2.0,54.005,2
165,Sarjapur,2 BHK,1145 - 1340,2.0,43.490,2
188,KR Puram,2 BHK,1015 - 1540,2.0,56.800,2
410,Kengeri,1 BHK,34.46Sq. Meter,1.0,18.500,1
549,Hennur Road,2 BHK,1195 - 1440,2.0,63.770,2
648,Arekere,9 Bedroom,4125Perch,9.0,265.000,9
661,Yelahanka,2 BHK,1120 - 1145,2.0,48.130,2
672,Bettahalsoor,4 Bedroom,3090 - 5002,4.0,445.000,4

In [23]:
# We will replace the range values with the average value of the range and we will drop teh rows having different units. To build a more sophiscated model we can do unit conversions as well for these kind of data issues

In [24]:
def convert_range_to_avg(x):
    tokens = x.split('-')
    if len(tokens) == 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [25]:
convert_range_to_avg('1234')

1234.0

In [26]:
convert_range_to_avg('2100 - 2850')

2475.0

In [27]:
convert_range_to_avg('34.46Sq. Meter')

In [28]:
df4 = df3.copy()
df4['total_sqft'] = df4['total_sqft'].apply(convert_range_to_avg)

In [29]:
df4.head()

,location,size,total_sqft,bath,price,no_of_bedrooms
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3
4,Kothanur,2 BHK,1200.0,2.0,51.00,2

In [30]:
df4[~df4['total_sqft'].apply(is_float)].head(10)

Empty DataFrame
Columns: [location, size, total_sqft, bath, price, no_of_bedrooms]
Index: []

In [31]:
df4.loc[30]

location          Yelahanka
size                  4 BHK
total_sqft           2475.0
bath                    4.0
price                 186.0
no_of_bedrooms            4
Name: 30, dtype: object

In [32]:
df4.head()

,location,size,total_sqft,bath,price,no_of_bedrooms
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3
4,Kothanur,2 BHK,1200.0,2.0,51.00,2

In [33]:
df5=df4.copy()

In [34]:
df5['price_per_sqft'] = df5['price']*100000/df5['total_sqft']
df5.head()

,location,size,total_sqft,bath,price,no_of_bedrooms,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [35]:
df5.location.unique()

array(['Electronic City Phase II', 'Chikka Tirupathi', 'Uttarahalli', ...,
       '12th cross srinivas nagar banshankari 3rd stage',
       'Havanur extension', 'Abshot Layout'], dtype=object)

In [36]:
len(df5.location.unique())  # Too many features

1304

In [37]:
df5['location'].value_counts()

Whitefield           534
Sarjapur  Road       392
Electronic City      302
Kanakpura Road       266
Thanisandra          233
                    ...
Vidyapeeta             1
Maruthi Extension      1
Okalipura              1
Old Town               1
Abshot Layout          1
Name: location, Length: 1304, dtype: int64

In [38]:
df5.location = df5.location.apply(lambda x: x.strip()) # This will remove leading & trailing spaces

In [39]:
locations_stats=df5.groupby('location')['location'].agg('count').sort_values(ascending=False)
locations_stats

location
Whitefield               535
Sarjapur  Road           392
Electronic City          304
Kanakpura Road           266
Thanisandra              236
                        ...
1 Giri Nagar               1
Kanakapura Road,           1
Kanakapura main  Road      1
Karnataka Shabarimala      1
whitefiled                 1
Name: location, Length: 1293, dtype: int64

In [42]:
len(locations_stats[locations_stats<=10])

1052

In [43]:
locations_stats_less_than_10  = locations_stats[locations_stats<=10]

In [44]:
locations_stats_less_than_10

location
Basapura                 10
1st Block Koramangala    10
Gunjur Palya             10
Kalkere                  10
Sector 1 HSR Layout      10
                         ..
1 Giri Nagar              1
Kanakapura Road,          1
Kanakapura main  Road     1
Karnataka Shabarimala     1
whitefiled                1
Name: location, Length: 1052, dtype: int64

In [45]:
len(df5.location.unique())

1293

In [46]:
df5.location = df5.location.apply(lambda x: 'other' if x in locations_stats_less_than_10 else x)

In [49]:
df5.head(10)

,location,size,total_sqft,bath,price,no_of_bedrooms,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
5,Whitefield,2 BHK,1170.0,2.0,38.00,2,3247.863248
6,Old Airport Road,4 BHK,2732.0,4.0,204.00,4,7467.057101
7,Rajaji Nagar,4 BHK,3300.0,4.0,600.00,4,18181.818182
8,Marathahalli,3 BHK,1310.0,3.0,63.25,3,4828.244275
9,other,6 Bedroom,1020.0,6.0,370.00,6,36274.509804

In [48]:
len(df5.location.unique())

242